use Савицкая_MyBase
Select Учет_работы.ID_работника,Операции.Наименование_операции, Учет_работы.Количество_деталей, Операции.Признак_сложности
 From  Операции, Учет_работы
 Where Операции.Номер_операции = Учет_работы.Номер_операции
 and 
 ID_работника in (select ID_работника from  Работники where (Телефон like '37529%'))

select Учет_работы.ID_работника,Операции.Наименование_операции, Учет_работы.Количество_деталей, Операции.Признак_сложности
 from Операции inner join Учет_работы
 on Операции.Номер_операции = Учет_работы.Номер_операции
 where ID_работника in (select ID_работника from  Работники where (Телефон like '37529%'))

 select Учет_работы.ID_работника,Операции.Наименование_операции, Учет_работы.Количество_деталей, Операции.Признак_сложности
  from Операции inner join Учет_работы
  on Операции.Номер_операции = Учет_работы.Номер_операции
  inner join Работники
  on Учет_работы.ID_работника = Работники.ID_работника
  where (Телефон like '37529%')


select ID_работника, Количество_деталей
 from Учет_работы а
 Where Номер_операции = (SELECT top(1) Номер_операции FROM Учет_работы аа
  Where аа.ID_работника = а.ID_работника)
  ORDER BY Количество_деталей desc

select Фамилия from Работники
 where not exists (select * from Учет_работы
  where Работники.ID_работника = Учет_работы.ID_работника)

select top 1 
  (select avg(Стаж) from Работники
    where Район like 'Лененский' ) [Лененский]
from Работники

select Номер_операции, Оплата from Операции
  where Оплата >= all (select Оплата from Операции
   where Признак_сложности like 'л%')

select Номер_операции, Оплата from Операции
  where Оплата >= any (select Оплата from Операции
   where Признак_сложности like 'л%')
 
